# 함수 구조
# def 함수명(매개변수1, 매개변수2):
#     수행 문장1
#     수행 문장2
#     반환값 (생략 가능)
# def sum(n1, n2):
#     print(n1, n2)
#     return n1 + n2
#
# 변수는 괄호가 없고 : sum
# 함수는 괄호가 있다 : sum()




# 함수 이름
## 함수의 목적을 설명하는 동사
## 또는 동사 + 명사를 사용
# square(num)   // 정수를 제곱하는 함수
# compute_average(list) // 평균을 구하는 함수
# set_cursor_type(c) // 커서의 타입 설정
# showResult() // 결과 출력
# 파이참에서 함수 이름은 소문자 사용 권장


# 함수 사용
## 함수를 사용하려면 함수를 호출(call)해야 한다.
## 함수 호출 : 함수이름을 적는다
## 함수는 호출하지 않으면 아무 일도 하지 않는다!
# def show_hello():
    print('hello')
# show_hello()
# 주의!!! 함수를 호출하기 전에 먼저 함수를 정의해야 한다.
